Revert "copia pre-mermaid"
This reverts commit b20c048daad0bd804723409aae951c2af5478b34.
